//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  CsmOptOut.uni
//
// Description: String definitions for CsmOptOut module setup controls
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_CSM_OPTOUT_FORM                                 #language eng "CSM parameters"
#string STR_CSM_OPTOUT_FORM_HELP                            #language eng "OpROM execution, boot options filter, etc."

#string STR_CSM_LAUNCH_POLICY                               #language eng "Launch CSM"
#string STR_CSM_LAUNCH_POLICY_HELP                          #language eng "This option controls if CSM will be launched"

#string STR_BOOT_OPTION_FILTERING_POLICY                    #language eng "Boot option filter"
#string STR_BOOT_OPTION_FILTERING_POLICY_HELP               #language eng "This option controls what devices system can boot to"
#string STR_BOOT_OPTION_FILTERING_POLICY_ALL                #language eng "UEFI and Legacy"
#string STR_BOOT_OPTION_FILTERING_POLICY_LEGACY_ONLY        #language eng "Legacy only"
#string STR_BOOT_OPTION_FILTERING_POLICY_UEFI_ONLY          #language eng "UEFI only"

#string STR_PXE_OPROM_POLICY                                #language eng "Launch PXE OpROM policy"
#string STR_PXE_OPROM_POLICY_HELP                           #language eng "Controls the execution of UEFI and Legacy PXE OpROM"

#string STR_MASS_STORAGE_OPROM_POLICY                       #language eng "Launch Storage OpROM policy"
#string STR_MASS_STORAGE_OPROM_POLICY_HELP                  #language eng "Controls the execution of UEFI and Legacy Storage OpROM"

#string STR_VIDEO_OPROM_POLICY                              #language eng "Launch Video OpROM policy"
#string STR_VIDEO_OPROM_POLICY_HELP                         #language eng "Controls the execution of UEFI and Legacy Video OpROM"

#string STR_OPROM_POLICY_DISABLE                            #language eng "Do not launch"
#string STR_OPROM_POLICY_UEFI_ONLY                          #language eng "UEFI only"
#string STR_OPROM_POLICY_LEGACY_ONLY                        #language eng "Legacy only"
#string STR_OPROM_POLICY_LEGACY_BEFORE_UEFI                 #language eng "Legacy first"
#string STR_OPROM_POLICY_LEGACY_AFTER_UEFI                  #language eng "UEFI first"

#string STR_OLD_OPROM_LAUNCH_POLICY                         #language eng "Other PCI device ROM priority"
#string STR_OLD_OPROM_LAUNCH_POLICY_HELP                    #language eng "For PCI devices other than Network, Mass storage or Video defines which OpROM to launch"
#string STR_OLD_OPROM_LAUNCH_POLICY_UEFI                    #language eng "UEFI OpROM"
#string STR_OLD_OPROM_LAUNCH_POLICY_LEGACY                  #language eng "Legacy OpROM"
#string STR_OLD_OPROM_LAUNCH_POLICY_LEGACY_AND_UEFI         #language eng "Legacy and UEFI OpROM"

#string STR_LEGACY_VIDEO_MSGBOX_TITLE                       #language eng " Warning!!!! "
#string STR_LEGACY_VIDEO_MSGBOX_MESSAGE                     #language eng "Video is in Legacy mode. Select Video policy UEFI first, reboot and try again"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
